import { Component, Vue } from 'vue-property-decorator';

@Component
export default class HomeComponent extends Vue {
    $refs!: {
        whoBox: HTMLBodyElement,
        whatBox: HTMLBodyElement
    }
    items: object[] = [
        {
            title: 'Погано охолоджує',
            text:'1. Витік холодоагенту з холодильної системи.\n' +
                '2. Засмічені пластини повітряного конденсатора.\n' +
                '3. Погана циркуляція повітря.\n' +
                '4. Неправильні налаштування термостата.\n' +
                'Вжити заходи:\n' +
                '1. Відключити холодильну шафу. Викликати техніка сервісної служби для діагностики витоку і ремонту.\n' +
                '2. Відключити холодильну шафу. Прочистити пластини повітряного конденсатора.\n' +
                '3. Звільнити простір навколо холодильної шафи для вільної циркуляції повітря(не менше 7 см.)\n' +
                '4. Викликати техніка сервісної служби для зміни налаштувань термостата.'
        },
        {
            title: 'Компресор працює не відключаючись. Продукт всередині шафи замерзає.',
            text: '1. Не правильно працює термостат(або контролер) або датчик температури.\n' +
                'Вжити заходи:\n' +
                '1. Відключити холодильну шафу від мережі живлення. Викликати техніка сервісної служби для заміни пристрою.'
        },
        {
            title: 'Компресор не працює, вентилятор конденсатора працює.',
            text: 'Можливі причини:\n' +
                '\n' +
                '1. Пусковий реле компресора вийшло з ладу.\n' +
                '2. Компресор вийшов з ладу.\n' +
                'Вживані заходи:\n' +
                '1. Викликати техніка сервісної служби для проведення ремонтних робіт..'
        },
        {
            title: '\n' +
                'Шум при роботі холодильної шафи. Шум при роботі компресора. Шум при роботі вентилятора.',
            text: 'Можливі причини:\n' +
                '1. Деякі частини холодильного агрегату стикаються з корпусом холодильної шафи.\n' +
                '2. Сторонні шуми в компресорі.\n' +
                '3. Порушена фіксація мотора вентилятора або його лопатей.\n' +
                '4. Лопаті вентилятора стикаються з повітряним конденсатором.\n' +
                'Вживані заходи:\n' +
                '1. Викликати техніка сервісної служби для проведення ремонтних робіт..'
        },
    ];
    panel: boolean[] = [ true, false, false, false ];

    name: string = "";
    email: string = "";
    subject: string = "";
    message: string = "";

    getBackground(i: number){
        if(!this.panel[i]){
            return "transparent";
        }
    }

    data () {
        return {
            search: '',
            pagination: {},
            selected: [],
            headers: [
                {
                    text: 'Послуга',
                    align: 'left',
                    sortable: false,
                    value: 'name'
                },
                { text: 'Ціна (робота + запчастини)', value: 'calories' },
            ],
            desserts: [
                {
                    name: 'виклик сервіс-інженера (з урахуванням ремонту)',
                    calories: '190 грн.'
                },
                {
                    name: 'виклик сервіс-інженера (тільки діагностика)',
                    calories: '290 грн.'
                },
                {
                    name: 'дозаправка холод. агента(фреону) Промислові',
                    calories: 'від 590 грн.'
                },
                {
                    name: 'дозаправка холод. агента(фреону) Побутові',
                    calories: 'від 350 грн.'
                },
                {
                    name: 'чистка конденсатора від бруду, жиру, пуху ',
                    calories: '375 грн./од'
                },
                {
                    name: 'заміна вентилятора конденсатора',
                    calories: '670 грн.'
                },
                {
                    name: 'пошук та усунення витоку фреону(пайка)',
                    calories: '700 грн.'
                },
                {
                    name: 'заміна контролера',
                    calories: 'від 900 грн.'
                },
                {
                    name: 'заміна датчика температури',
                    calories: '490 грн.'
                },
                {
                    name: 'заміна лампи(довгі люмінесцентні)',
                    calories: 'від 250 грн.'
                },
                {
                    name: 'безпечна мийка холодильного обладнання ',
                    calories: '420 грн./од.'
                },
                {
                    name: 'повне технічне обслуговування кондиціонера',
                    calories: '590 грн.'
                },
                {
                    name: 'заміна ТЕН-а відтайки',
                    calories: 'від 600 грн.'
                },
                {
                    name: 'заміна капілярної трубки(+фільтр)',
                    calories: 'від 920 грн.'
                },
                {
                    name: 'заміна термо-регулюючого вентиля (ТРВ)',
                    calories: 'від 700 грн.'
                },
                {
                    name: 'вирівнювання ребер(ламелі) конденсатора',
                    calories: '470 грн./од.'
                },
                {
                    name: 'ізоляція труб (K-FLEX)',
                    calories: '380 грн./м'
                },
                {
                    name: 'установка заправного клапана (Шредер)',
                    calories: '370 грн.'
                },
                {
                    name: 'заміна компресора',
                    calories: 'від 1800 грн.'
                }
            ]
        }
    }

    pages (p: any) {
        if (p.rowsPerPage == null ||
        p.totalItems == null
        ) return 0

        return Math.ceil(p.totalItems / p.rowsPerPage)
    }

}